## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: digitalocean
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-   destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # digitalocean_domain.do-wayofthesys must be replaced
-/+ resource "digitalocean_domain" "do-wayofthesys" {
!       id   = "do.wayofthesys.com" -> (known after apply)
!       name = "do.wayofthesys.com" -> "wayofthesys.org" # forces replacement
!       ttl  = 1800 -> (known after apply)
!       urn  = "do:domain:do.wayofthesys.com" -> (known after apply)
    }

  # digitalocean_record.test will be destroyed
  # (because digitalocean_record.test is not in configuration)
-   resource "digitalocean_record" "test" {
-       domain   = "do.wayofthesys.com" -> null
-       flags    = 0 -> null
-       fqdn     = "test.do.wayofthesys.com" -> null
-       id       = "338149518" -> null
-       name     = "test" -> null
-       port     = 0 -> null
-       priority = 0 -> null
-       ttl      = 1800 -> null
-       type     = "A" -> null
-       value    = "159.89.244.226" -> null
-       weight   = 0 -> null
    }

Plan: 1 to add, 0 to change, 2 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:digitalocean workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| digitalocean | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
